Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMC21_DFP/3.0.26/Microchip.SAMC21_DFP.pdsc
         <device Dname="ATSAMC21J17A">
            <processor Dcore="Cortex-M0+" Dendian="Little-endian" Dmpu="MPU" Dfpu="NO_FPU"/>
            <compile header="samc21/include/sam.h" define="__SAMC21J17A__"/>
            <debug svd="samc21/svd/ATSAMC21J17A.svd"/>
            <memory id="IROM1" start="0x00000000" size="0x20000" default="1" startup="1"/>
            <memory id="IROM2" start="0x00400000" size="0x1000"/>
            <memory id="IRAM1" start="0x20000000" size="0x4000" default="1"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension" schemaVersion="1.0">
                  <at:atdf name="samc21/atdf/ATSAMC21J17A.atdf"/>
                  <at:variant ordercode="SAMC21J17A-MU" vccmin="2.7" vccmax="5.5" tempmin="-40" tempmax="85"/>
                  <at:variant ordercode="SAMC21J17A-MN" vccmin="2.7" vccmax="5.5" tempmin="-40" tempmax="105"/>
                  <at:variant ordercode="SAMC21J17A-MZ" vccmin="2.7" vccmax="5.5" tempmin="-40" tempmax="125"/>
                  <at:variant ordercode="SAMC21J17A-AU" vccmin="2.7" vccmax="5.5" tempmin="-40" tempmax="85"/>
                  <at:variant ordercode="SAMC21J17A-AN" vccmin="2.7" vccmax="5.5" tempmin="-40" tempmax="105"/>
                  <at:variant ordercode="SAMC21J17A-AZ" vccmin="2.7" vccmax="5.5" tempmin="-40" tempmax="125"/>
                  <at:memory name="FLASH" start="0x00000000" size="0x20000" type="flash" pagesize="64" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="OTP5" start="0x00806020" size="0x8" type="fuses" rw="R" address-space="base"/>
                  <at:memory name="TEMP_LOG" start="0x00806030" size="0x8" type="fuses" rw="R" address-space="base"/>
                  <at:memory name="USER_PAGE" start="0x00804000" size="0x100" type="user_page" pagesize="64" rw="RW" address-space="base"/>
                  <at:memory name="RWW" start="0x00400000" size="0x1000" type="flash" pagesize="64" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="HSRAM" start="0x20000000" size="0x4000" type="ram" rw="RW" exec="true" address-space="base"/>
                  <at:memory name="HPB0" start="0x40000000" size="0x4000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="HPB1" start="0x41000000" size="0x10000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="HPB2" start="0x42000000" size="0x8000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="DIVAS" start="0x48000000" size="0x20" type="io" rw="RW" address-space="base"/>
                  <at:memory name="PPB" start="0xE0000000" size="0x100000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="SCS" start="0xE000E000" size="0x00001000" type="io" rw="RW" address-space="base"/>
                  <at:memory name="PERIPHERALS" start="0x40000000" size="0x20000000" type="io" rw="RW" address-space="base"/>
                  <at:interface type="swd" name="SWD"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.nedbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.pickit4"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.samice"/>
                  <at:project name="Barebone C Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Microchip" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.c)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone Cpp Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Microchip" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.cpp)"/>
                     </at:component>
                  </at:project>
                  <at:prerequisite context="compiling" Tcompiler="GCC" component="ARM-GCC"/>
                  <at:prerequisite context="compiling" Tcompiler="IAR" component="ARM-IAR"/>
                  <at:prerequisite context="compiling" Tcompiler="ARMCC" component="ARMCC"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension" schemaVersion="1.0">
                  <mchp:pic name="samc21/edc/ATSAMC21J17A.PIC"/>
                  <mchp:prerequisite component="MPLAB X IDE" version="[5.20-"/>
               </mchp:extension>
            </environment>
            <description>5V ARM Cortex-M0+ based microcontroller with 128KB Flash, 16KB SRAM, 48 MHz, five 16-bit timer/counters, DMA, six SERCOMs, two 12-bit ADC (20 unique channels), 10-bit DAC, 64 pins, dual CAN, LIN (master/slave), 16-bit Sigma Delta ADC</description>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=ATSAMC21J17A" title="Device page for ATSAMC21J17A"/>
            <book name="https://www.microchip.com/wwwproducts/productds/ATSAMC21J17A" title="Datasheet"/>
         </device>
      </family>
   </devices>
   <conditions>
      <condition id="ARMCC">
         <accept Tcompiler="ARMCC"/>
      </condition>
      <condition id="ARMCC Exe">
         <accept Tcompiler="ARMCC" Toutput="exe"/>
      </condition>
      <condition id="GCC">
         <accept Tcompiler="GCC"/>
      </condition>
      <condition id="GCC Exe">
         <accept Tcompiler="GCC" Toutput="exe"/>
      </condition>
      <condition id="IAR">
         <accept Tcompiler="IAR"/>
      </condition>
      <condition id="IAR Exe">
         <accept Tcompiler="IAR" Toutput="exe"/>
      </condition>
      <condition id="C">
         <accept Tcompiler="ARMCC"/>
         <accept Tcompiler="GCC"/>
         <accept Tcompiler="IAR"/>
      </condition>
      <condition id="C Exe">
         <accept Tcompiler="ARMCC" Toutput="exe"/>
         <accept Tcompiler="GCC" Toutput="exe"/>
         <accept Tcompiler="IAR" Toutput="exe"/>
      </condition>
      <condition id="C Lib">
         <accept Tcompiler="ARMCC" Toutput="lib"/>
         <accept Tcompiler="GCC" Toutput="lib"/>
         <accept Tcompiler="IAR" Toutput="lib"/>
      </condition>
      <condition id="ATSAMC21J15A">
         <require Dvendor="Microchip:3" Dname="ATSAMC21J15A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMC21N17A">
         <require Dvendor="Microchip:3" Dname="ATSAMC21N17A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMC21E15A">
         <require Dvendor="Microchip:3" Dname="ATSAMC21E15A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMC21J18A">
         <require Dvendor="Microchip:3" Dname="ATSAMC21J18A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMC21E18A">
         <require Dvendor="Microchip:3" Dname="ATSAMC21E18A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMC21J18AU">
         <require Dvendor="Microchip:3" Dname="ATSAMC21J18AU"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
