Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMC21_DFP/3.0.26/Microchip.SAMC21_DFP.pdsc
      <condition id="ATSAMC21E16A">
         <require Dvendor="Microchip:3" Dname="ATSAMC21E16A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMC21E17A">
         <require Dvendor="Microchip:3" Dname="ATSAMC21E17A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMC21G17A">
         <require Dvendor="Microchip:3" Dname="ATSAMC21G17A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMC21N18A">
         <require Dvendor="Microchip:3" Dname="ATSAMC21N18A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMC21J17AU">
         <require Dvendor="Microchip:3" Dname="ATSAMC21J17AU"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMC21G16A">
         <require Dvendor="Microchip:3" Dname="ATSAMC21G16A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMC21J16A">
         <require Dvendor="Microchip:3" Dname="ATSAMC21J16A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMC21G15A">
         <require Dvendor="Microchip:3" Dname="ATSAMC21G15A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMC21G18A">
         <require Dvendor="Microchip:3" Dname="ATSAMC21G18A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMC21J17A">
         <require Dvendor="Microchip:3" Dname="ATSAMC21J17A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
   </conditions>
   <components>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.0.0" condition="ATSAMC21J15A">
         <description>Headers and startup code for Microchip ATSAMC21J15A</description>
         <files>
            <file condition="C" category="include" name="samc21/include"/>
            <file condition="C" category="header" name="samc21/include/sam.h"/>
            <file condition="C Exe" category="source" name="samc21/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samc21/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samc21/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samc21/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samc21/gcc/gcc/startup_samc21j15a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samc21/gcc/system_samc21j15a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samc21/gcc/gcc/samc21j15a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samc21/gcc/gcc/samc21j15a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samc21/armcc/armcc/startup_samc21j15a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samc21/armcc/system_samc21j15a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samc21/iar/iar/startup_samc21j15a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samc21/iar/system_samc21j15a.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samc21/iar/iar/samc21j15a_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samc21/iar/iar/samc21j15a_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.0.0" condition="ATSAMC21N17A">
         <description>Headers and startup code for Microchip ATSAMC21N17A</description>
         <files>
            <file condition="C" category="include" name="samc21n/include"/>
            <file condition="C" category="header" name="samc21n/include/sam.h"/>
            <file condition="C Exe" category="source" name="samc21n/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samc21n/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samc21n/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samc21n/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samc21n/gcc/gcc/startup_samc21n17a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samc21n/gcc/system_samc21n17a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samc21n/gcc/gcc/samc21n17a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samc21n/gcc/gcc/samc21n17a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samc21n/armcc/armcc/startup_samc21n17a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samc21n/armcc/system_samc21n17a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samc21n/iar/iar/startup_samc21n17a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samc21n/iar/system_samc21n17a.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samc21n/iar/iar/samc21n17a_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samc21n/iar/iar/samc21n17a_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.0.0" condition="ATSAMC21E15A">
         <description>Headers and startup code for Microchip ATSAMC21E15A</description>
         <files>
            <file condition="C" category="include" name="samc21/include"/>
            <file condition="C" category="header" name="samc21/include/sam.h"/>
            <file condition="C Exe" category="source" name="samc21/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samc21/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samc21/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samc21/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samc21/gcc/gcc/startup_samc21e15a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samc21/gcc/system_samc21e15a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samc21/gcc/gcc/samc21e15a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samc21/gcc/gcc/samc21e15a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samc21/armcc/armcc/startup_samc21e15a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samc21/armcc/system_samc21e15a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samc21/iar/iar/startup_samc21e15a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samc21/iar/system_samc21e15a.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samc21/iar/iar/samc21e15a_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samc21/iar/iar/samc21e15a_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.0.0" condition="ATSAMC21J18A">
         <description>Headers and startup code for Microchip ATSAMC21J18A</description>
         <files>
            <file condition="C" category="include" name="samc21/include"/>
            <file condition="C" category="header" name="samc21/include/sam.h"/>
            <file condition="C Exe" category="source" name="samc21/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samc21/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samc21/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samc21/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samc21/gcc/gcc/startup_samc21j18a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samc21/gcc/system_samc21j18a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samc21/gcc/gcc/samc21j18a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samc21/gcc/gcc/samc21j18a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samc21/armcc/armcc/startup_samc21j18a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samc21/armcc/system_samc21j18a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samc21/iar/iar/startup_samc21j18a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samc21/iar/system_samc21j18a.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samc21/iar/iar/samc21j18a_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samc21/iar/iar/samc21j18a_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.0.0" condition="ATSAMC21E18A">
         <description>Headers and startup code for Microchip ATSAMC21E18A</description>
         <files>
            <file condition="C" category="include" name="samc21/include"/>
            <file condition="C" category="header" name="samc21/include/sam.h"/>
            <file condition="C Exe" category="source" name="samc21/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samc21/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samc21/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samc21/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samc21/gcc/gcc/startup_samc21e18a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samc21/gcc/system_samc21e18a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samc21/gcc/gcc/samc21e18a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samc21/gcc/gcc/samc21e18a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samc21/armcc/armcc/startup_samc21e18a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samc21/armcc/system_samc21e18a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samc21/iar/iar/startup_samc21e18a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samc21/iar/system_samc21e18a.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samc21/iar/iar/samc21e18a_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samc21/iar/iar/samc21e18a_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.0.0" condition="ATSAMC21J18AU">
         <description>Headers and startup code for Microchip ATSAMC21J18AU</description>
         <files>
            <file condition="C" category="include" name="samc21/include"/>
            <file condition="C" category="header" name="samc21/include/sam.h"/>
            <file condition="C Exe" category="source" name="samc21/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samc21/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samc21/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samc21/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samc21/gcc/gcc/startup_samc21j18au.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samc21/gcc/system_samc21j18au.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samc21/gcc/gcc/samc21j18au_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samc21/gcc/gcc/samc21j18au_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samc21/armcc/armcc/startup_samc21j18au.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samc21/armcc/system_samc21j18au.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samc21/iar/iar/startup_samc21j18au.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samc21/iar/system_samc21j18au.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samc21/iar/iar/samc21j18au_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samc21/iar/iar/samc21j18au_sram.icf" attr="config"/>
         </files>
      </component>
