Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMC21_DFP/3.0.26/Microchip.SAMC21_DFP.pdsc
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.0.0" condition="ATSAMC21E16A">
         <description>Headers and startup code for Microchip ATSAMC21E16A</description>
         <files>
            <file condition="C" category="include" name="samc21/include"/>
            <file condition="C" category="header" name="samc21/include/sam.h"/>
            <file condition="C Exe" category="source" name="samc21/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samc21/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samc21/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samc21/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samc21/gcc/gcc/startup_samc21e16a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samc21/gcc/system_samc21e16a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samc21/gcc/gcc/samc21e16a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samc21/gcc/gcc/samc21e16a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samc21/armcc/armcc/startup_samc21e16a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samc21/armcc/system_samc21e16a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samc21/iar/iar/startup_samc21e16a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samc21/iar/system_samc21e16a.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samc21/iar/iar/samc21e16a_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samc21/iar/iar/samc21e16a_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.0.0" condition="ATSAMC21E17A">
         <description>Headers and startup code for Microchip ATSAMC21E17A</description>
         <files>
            <file condition="C" category="include" name="samc21/include"/>
            <file condition="C" category="header" name="samc21/include/sam.h"/>
            <file condition="C Exe" category="source" name="samc21/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samc21/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samc21/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samc21/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samc21/gcc/gcc/startup_samc21e17a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samc21/gcc/system_samc21e17a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samc21/gcc/gcc/samc21e17a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samc21/gcc/gcc/samc21e17a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samc21/armcc/armcc/startup_samc21e17a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samc21/armcc/system_samc21e17a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samc21/iar/iar/startup_samc21e17a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samc21/iar/system_samc21e17a.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samc21/iar/iar/samc21e17a_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samc21/iar/iar/samc21e17a_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.0.0" condition="ATSAMC21G17A">
         <description>Headers and startup code for Microchip ATSAMC21G17A</description>
         <files>
            <file condition="C" category="include" name="samc21/include"/>
            <file condition="C" category="header" name="samc21/include/sam.h"/>
            <file condition="C Exe" category="source" name="samc21/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samc21/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samc21/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samc21/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samc21/gcc/gcc/startup_samc21g17a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samc21/gcc/system_samc21g17a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samc21/gcc/gcc/samc21g17a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samc21/gcc/gcc/samc21g17a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samc21/armcc/armcc/startup_samc21g17a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samc21/armcc/system_samc21g17a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samc21/iar/iar/startup_samc21g17a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samc21/iar/system_samc21g17a.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samc21/iar/iar/samc21g17a_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samc21/iar/iar/samc21g17a_sram.icf" attr="config"/>
         </files>
      </component>
