Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMC21_DFP/3.0.26/Microchip.SAMC21_DFP.pdsc
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.0.0" condition="ATSAMC21G18A">
         <description>Headers and startup code for Microchip ATSAMC21G18A</description>
         <files>
            <file condition="C" category="include" name="samc21/include"/>
            <file condition="C" category="header" name="samc21/include/sam.h"/>
            <file condition="C Exe" category="source" name="samc21/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samc21/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samc21/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samc21/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samc21/gcc/gcc/startup_samc21g18a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samc21/gcc/system_samc21g18a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samc21/gcc/gcc/samc21g18a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samc21/gcc/gcc/samc21g18a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samc21/armcc/armcc/startup_samc21g18a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samc21/armcc/system_samc21g18a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samc21/iar/iar/startup_samc21g18a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samc21/iar/system_samc21g18a.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samc21/iar/iar/samc21g18a_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samc21/iar/iar/samc21g18a_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="3.0.0" condition="ATSAMC21J17A">
         <description>Headers and startup code for Microchip ATSAMC21J17A</description>
         <files>
            <file condition="C" category="include" name="samc21/include"/>
            <file condition="C" category="header" name="samc21/include/sam.h"/>
            <file condition="C Exe" category="source" name="samc21/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samc21/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samc21/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samc21/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samc21/gcc/gcc/startup_samc21j17a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samc21/gcc/system_samc21j17a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samc21/gcc/gcc/samc21j17a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samc21/gcc/gcc/samc21j17a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samc21/armcc/armcc/startup_samc21j17a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samc21/armcc/system_samc21j17a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samc21/iar/iar/startup_samc21j17a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samc21/iar/system_samc21j17a.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samc21/iar/iar/samc21j17a_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samc21/iar/iar/samc21j17a_sram.icf" attr="config"/>
         </files>
      </component>
   </components>
</package>
